In [1]:
import numpy as np
import pandas as pd

In [2]:
data = pd.read_csv("/home/mike/Downloads/data/archive(8)/Immigration_Madrid_2021.csv")

In [3]:
data.head()

,Unnamed: 0,Gender,Age,Studies,Nationality,Administrative_situation,Working
0,0,Women,51-65,College,España,Community,No
1,1,Women,51-65,College,Venezuela,ART,No
2,2,Women,18-30,Pre-college,Honduras,Refugee,No
3,3,Women,18-30,Pre-college,Venezuela,Community,No
4,4,Women,18-30,Pre-college,República Dominicana,Community_familiar,No

In [4]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1523 entries, 0 to 1522
Data columns (total 7 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Unnamed: 0                1523 non-null   int64
 1   Gender                    1523 non-null   object
 2   Age                       1523 non-null   object
 3   Studies                   1523 non-null   object
 4   Nationality               1523 non-null   object
 5   Administrative_situation  1523 non-null   object
 6   Working                   1523 non-null   object
dtypes: int64(1), object(6)
memory usage: 83.4+ KB

In [6]:
data.Gender.str.lower()

0       women
1       women
2       women
3       women
4       women
        ...
1518    women
1519    women
1520    women
1521    women
1522    women
Name: Gender, Length: 1523, dtype: object

In [8]:
data.columns

Index(['Unnamed: 0', 'Gender', 'Age', 'Studies', 'Nationality',
       'Administrative_situation', 'Working'],
      dtype='object')

In [9]:
text = ['Gender','Studies', 'Nationality', 'Administrative_situation', 'Working']

In [14]:
data.Nationality.str.upper()

0                     ESPAÑA
1                  VENEZUELA
2                   HONDURAS
3                  VENEZUELA
4       REPÚBLICA DOMINICANA
                ...
1518                  ESPAÑA
1519                  ESPAÑA
1520               MARRUECOS
1521               MARRUECOS
1522               MARRUECOS
Name: Nationality, Length: 1523, dtype: object

In [15]:
data.Nationality.str.len()

0        6
1        9
2        8
3        9
4       20
        ..
1518     6
1519     6
1520     9
1521     9
1522     9
Name: Nationality, Length: 1523, dtype: int64

In [16]:
data.Nationality.str.strip()

0                     España
1                  Venezuela
2                   Honduras
3                  Venezuela
4       República Dominicana
                ...
1518                  España
1519                  España
1520               Marruecos
1521               Marruecos
1522               Marruecos
Name: Nationality, Length: 1523, dtype: object

In [19]:
data.Nationality.str.split()[1]

['Venezuela']

In [20]:
data.Nationality.str.get_dummies()

,Argelia,Argentina,Bangladesh,Bolivia,Brasil,Cabo Verde,Camerún,Chile,China,Colombia,...,República de Corea,República Árabe Siria,Rumania,Sahara,Senegal,Sierra Leona,Somalia,Togo,Ucrania,Venezuela
0,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,1
2,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
3,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,1
4,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1518,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1519,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1520,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1521,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1522,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0

In [24]:
data.Nationality.str.contains(" ").sum()

168

In [25]:
data.Nationality.str.replace(" ", "-")

0                     España
1                  Venezuela
2                   Honduras
3                  Venezuela
4       República-Dominicana
                ...
1518                  España
1519                  España
1520               Marruecos
1521               Marruecos
1522               Marruecos
Name: Nationality, Length: 1523, dtype: object

In [26]:
data.Nationality.str.repeat(2)

0                                   EspañaEspaña
1                             VenezuelaVenezuela
2                               HondurasHonduras
3                             VenezuelaVenezuela
4       República DominicanaRepública Dominicana
                          ...
1518                                EspañaEspaña
1519                                EspañaEspaña
1520                          MarruecosMarruecos
1521                          MarruecosMarruecos
1522                          MarruecosMarruecos
Name: Nationality, Length: 1523, dtype: object

In [27]:
data

,Unnamed: 0,Gender,Age,Studies,Nationality,Administrative_situation,Working
0,0,Women,51-65,College,España,Community,No
1,1,Women,51-65,College,Venezuela,ART,No
2,2,Women,18-30,Pre-college,Honduras,Refugee,No
3,3,Women,18-30,Pre-college,Venezuela,Community,No
4,4,Women,18-30,Pre-college,República Dominicana,Community_familiar,No
...,...,...,...,...,...,...,...
1518,1803,Women,18-30,Elementary_school,España,Community,No
1519,1804,Women,18-30,Elementary_school,España,Community,No
1520,1805,Women,18-30,Elementary_school,Marruecos,Community,No
1521,1806,Women,18-30,Elementary_school,Marruecos,Community,No
1522,1807,Women,18-30,Elementary_school,Marruecos,Community,No

In [29]:
data.Nationality.str.count("España").sum()

165

In [30]:
data.Nationality.str.startswith("E").sum()

407

In [31]:
data.Nationality.str.endswith("a").sum()

867

In [33]:
data.Nationality.str.find("España").sum()

-1358

In [35]:
data.Nationality.str.findall("España")

0       [España]
1             []
2             []
3             []
4             []
          ...
1518    [España]
1519    [España]
1520          []
1521          []
1522          []
Name: Nationality, Length: 1523, dtype: object

In [38]:
data.Nationality.str.swapcase()

0                     eSPAÑA
1                  vENEZUELA
2                   hONDURAS
3                  vENEZUELA
4       rEPÚBLICA dOMINICANA
                ...
1518                  eSPAÑA
1519                  eSPAÑA
1520               mARRUECOS
1521               mARRUECOS
1522               mARRUECOS
Name: Nationality, Length: 1523, dtype: object

In [40]:
data.Nationality.str.islower().sum()

0

In [41]:
data.Nationality.str.isupper().sum()

0

In [42]:
data.Nationality.str.isnumeric().sum()

0

In [43]:
data.head()

,Unnamed: 0,Gender,Age,Studies,Nationality,Administrative_situation,Working
0,0,Women,51-65,College,España,Community,No
1,1,Women,51-65,College,Venezuela,ART,No
2,2,Women,18-30,Pre-college,Honduras,Refugee,No
3,3,Women,18-30,Pre-college,Venezuela,Community,No
4,4,Women,18-30,Pre-college,República Dominicana,Community_familiar,No